<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads Firefox ESR into MacPatch</string>
    <key>Identifier</key>
    <string>com.github.smsg-mac-dev.macpatch.firefox-esr</string>
    <key>Input</key>
    <dict>
        <key>patch_name</key>
        <string>Firefox ESR #version#</string>
        <key>patch_id</key>
        <string>org.mozilla.firefox</string>
        <key>description</key>
        <string>Firefox ESR web browser</string>
        <key>description_url</key>
        <string>https://www.mozilla.org/en-US/firefox/organizations</string>
        <key>patch_vendor</key>
        <string>Mozilla</string>
        <key>patch_severity</key>
        <string>High</string>
        <key>OSType</key>
        <string>Mac OS X, Mac OS X Server</string>
        <key>OSVersion</key>
        <string>*</string>
        <key>patch_criteria</key>
        <array>
            <string>File@EXISTS@/Applications/Firefox.app@True</string>
            <string>File@VERSION@/Applications/Firefox.app@#version#;LT</string>
        </array>
        <key>patch_criteria_scripts</key>
        <false/>
        <key>pkg_preinstall</key>
        <true/>
        <key>pkg_postinstall</key>
        <false/>
        <key>pkg_env_var</key>
        <string></string>
        <key>patch_install_weight</key>
        <string>30</string>
        <key>patch_reboot</key>
        <string>No</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.Firefox_EN</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.SMSG-MAC-DEV.MacPatch-AutoPKG.MacPatchImporterProcessor/MacPatchImporterProcessor</string>
            <key>Arguments</key>
            <dict>
                <key>RELEASE</key>
                <string>esr-latest</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
