<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads VMware Horizon Client into MacPatch</string>

    <key>Identifier</key>
    <string>com.github.smsg-mac-dev.macpatch.VMwareHorizonClient</string>

    <key>Input</key>
    <dict>
        <key>patch_name</key>
        <string>VMWare Horizon Client #version#</string>

        <key>patch_id</key>
        <string>com.vmware.horizon</string>

        <key>description</key>
        <string>VMWare Horizon Client</string>

        <key>description_url</key>
        <string>https://www.vmware.com/products/horizon.html</string>

        <key>patch_vendor</key>
        <string>VMWare</string>

        <key>patch_severity</key>
        <string>High</string>

        <key>OSType</key>
        <string>Mac OS X, Mac OS X Server</string>

        <key>OSVersion</key>
        <string>*</string>

        <key>patch_criteria</key>
        <array>
            <string>File@EXISTS@/Applications/VMware Horizon Client.app@True</string>
            <string>File@VERSION@/Applications/VMware Horizon Client.app@#version#;LT</string>
        </array>

        <key>patch_criteria_scripts</key>
        <false/>

        <key>pkg_preinstall</key>
        <false/>

        <key>pkg_postinstall</key>
        <false/>

        <key>pkg_env_var</key>
        <string></string>

        <key>patch_install_weight</key>
        <string>30</string>

        <key>patch_reboot</key>
        <string>No</string>

        <array>
            <string>-0</string>
        </array>
    </dict>

    <key>MinimumVersion</key>
    <string>0.2.0</string>

    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.VMwareHorizonClient</string>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.SMSG-MAC-DEV.MacPatch-AutoPKG.MacPatchImporterProcessor/MacPatchImporterProcessor</string>
        </dict>
    </array>
</dict>
</plist>
