<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads VLC into MacPatch</string>

    <key>Identifier</key>
    <string>com.github.smsg-mac-dev.macpatch.xquartz</string>

    <key>Input</key>
    <dict>
        <key>patch_name</key>
        <string>XQuartz</string>

        <key>patch_id</key>
        <string>org.macosforge.xquartz.X11</string>

        <key>description</key>
        <string>XQuartz</string>

        <key>description_url</key>
        <string>http://xquartz.macosforge.org/trac/wiki/Releases</string>

        <key>patch_vendor</key>
        <string>macosforge</string>

        <key>patch_severity</key>
        <string>High</string>

        <key>OSType</key>
        <string>Mac OS X, Mac OS X Server</string>

        <key>OSVersion</key>
        <string>*</string>

        <key>patch_criteria</key>
        <array>
            <string>File@EXISTS@/Applications/Utilities/XQuartz.app@True</string>
            <string>File@VERSION@/Applications/Utilities/XQuartz.app@#version#;LT</string>
        </array>

        <key>patch_criteria_scripts</key>
        <false/>

        <key>pkg_preinstall</key>
        <false/>

        <key>pkg_postinstall</key>
        <true/>

        <key>pkg_env_var</key>
        <string></string>

        <key>patch_install_weight</key>
        <string>30</string>

        <key>patch_reboot</key>
        <string>No</string>
    </dict>

    <key>MinimumVersion</key>
    <string>0.2.0</string>

    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.xquartz</string>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/XQuartz.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            </dict>
            <key>Processor</key>
            <string>com.github.smsg-mac-dev.MacPatchImporterProcessor/MacPatchImporterProcessor</string>
        </dict>
    </array>
</dict>
</plist>